# Задание 1.

"""Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран."""

a = 5
s = 'Roma'

print(f"Вот заранее созданные переменные: {a}, {s}")

b = int(input("Введите число: "))
s1 = input("Введите строку: ")
print(f"Вот ваши введенные данные {b}, {s1}")

